arduino/ArduinoCore-mbed/cores/arduino/mbed/targets/TARGET_STM/TARGET_STM32H7/TARGET_STM32H747xI/COMPONENT_SE050/sss/inc/fsl_sss_mbedtls_apis.h
            sss_mbedtls_aead_context_free(((sss_mbedtls_aead_t * ) context))
        /* Host Call : mac */
#       define sss_host_mac_context_init(context,session,keyObject,algorithm,mode) \
            sss_mbedtls_mac_context_init(((sss_mbedtls_mac_t * ) context),((sss_mbedtls_session_t * ) session),((sss_mbedtls_object_t * ) keyObject),(algorithm),(mode))
#       define sss_host_mac_one_go(context,message,messageLen,mac,macLen) \
            sss_mbedtls_mac_one_go(((sss_mbedtls_mac_t * ) context),(message),(messageLen),(mac),(macLen))
#       define sss_host_mac_init(context) \
            sss_mbedtls_mac_init(((sss_mbedtls_mac_t * ) context))
#       define sss_host_mac_update(context,message,messageLen) \
            sss_mbedtls_mac_update(((sss_mbedtls_mac_t * ) context),(message),(messageLen))
#       define sss_host_mac_finish(context,mac,macLen) \
            sss_mbedtls_mac_finish(((sss_mbedtls_mac_t * ) context),(mac),(macLen))
#       define sss_host_mac_context_free(context) \
            sss_mbedtls_mac_context_free(((sss_mbedtls_mac_t * ) context))
        /* Host Call : md */
#       define sss_host_digest_context_init(context,session,algorithm,mode) \
            sss_mbedtls_digest_context_init(((sss_mbedtls_digest_t * ) context),((sss_mbedtls_session_t * ) session),(algorithm),(mode))
#       define sss_host_digest_one_go(context,message,messageLen,digest,digestLen) \
            sss_mbedtls_digest_one_go(((sss_mbedtls_digest_t * ) context),(message),(messageLen),(digest),(digestLen))
#       define sss_host_digest_init(context) \
            sss_mbedtls_digest_init(((sss_mbedtls_digest_t * ) context))
#       define sss_host_digest_update(context,message,messageLen) \
            sss_mbedtls_digest_update(((sss_mbedtls_digest_t * ) context),(message),(messageLen))
#       define sss_host_digest_finish(context,digest,digestLen) \
            sss_mbedtls_digest_finish(((sss_mbedtls_digest_t * ) context),(digest),(digestLen))
#       define sss_host_digest_context_free(context) \
            sss_mbedtls_digest_context_free(((sss_mbedtls_digest_t * ) context))
        /* Host Call : rng */
#       define sss_host_rng_context_init(context,session) \
            sss_mbedtls_rng_context_init(((sss_mbedtls_rng_context_t * ) context),((sss_mbedtls_session_t * ) session))
#       define sss_host_rng_get_random(context,random_data,dataLen) \
            sss_mbedtls_rng_get_random(((sss_mbedtls_rng_context_t * ) context),(random_data),(dataLen))
#       define sss_host_rng_context_free(context) \
            sss_mbedtls_rng_context_free(((sss_mbedtls_rng_context_t * ) context))
#   endif /* (SSS_HAVE_SSS == 1) */
/* clang-format on */
#endif /* SSS_HAVE_MBEDTLS */
#ifdef __cplusplus
} // extern "C"
#endif /* __cplusplus */

#endif /* FSL_SSS_MBEDTLS_APIS_H */
